ruediheimlicher/Atmega8_WL/Atmega8_WL.c
//
//  Tastenblinky.c
//  Tastenblinky
//
//  Created by Sysadmin on 03.10.07.
//  Copyright Ruedi Heimlihcer 2007. All rights reserved.
//



#include <avr/io.h>
#include <avr/delay.h>
#include <avr/interrupt.h>
#include <avr/pgmspace.h>
#include <string.h>
#include <inttypes.h>
//#define F_CPU 4000000UL  // 4 MHz
#include <avr/delay.h>
#include "lcd.c"
#include "adc.c"

//#include "onewire.c"
//#include "ds18x20.c"
//#include "crc8.c"

//#include "conio.h"
#include "defines.h"
#include "wireless.c"
#include "wl_module.h" 
#include "nRF24L01.h"

#define VREF 265

// lookup-Tabelle KTY84

// pgm_read_word(&KTY[xy])
#define KTY_OFFSET   30             // Offset, Start bei bei -32 °C
#define ADC_OFFSET   207            // Startwert der ADC-Messung
#define KTY_FAKTOR   96             // 0x60, Multiplikator
const uint16_t KTY[] PROGMEM =
{
   0x1D,	0x1FC,	0x3E8,	0x5B2,	0x789,	0x942,	0xB08,	0xCB2,
   0xE6A,	0x1007,	0x11B4,	0x1346,	0x14E8,	0x1672,	0x180B,	0x198D,
   0x1B1E,	0x1C9A,	0x1E24,	0x1F9A,	0x211F,	0x228F,	0x23FD,	0x257B,
   0x26E5,	0x285F,	0x29C6,	0x2B3D,	0x2CA0,	0x2E14,	0x2F75,	0x30E7,
   0x3246,	0x33B5,	0x3513,	0x3681,	0x37DD,	0x394A,	0x3AA5,	0x3C11,
   0x3D6B,	0x3ED7,	0x4031,	0x419C,	0x42F6,	0x4461,	0x45BB,	0x4716,
   0x4882,	0x49DD,	0x4B49,	0x4CA5,	0x4E13,	0x4F70,	0x50DE,	0x523D,
   0x53AD,	0x550C,	0x567F,	0x57E0,	0x5954,	0x5AB7,	0x5C2D,	0x5D93,
   0x5F0B,	0x6073,	0x61EF,	0x6359,	0x64D7,	0x6645,	0x67C6,	0x6936,
   0x6AA8,	0x6C2F,	0x6DA4,	0x6F2E,	0x70A7,	0x7235,	0x73B2,	0x7544,
   0x76C5,	0x785C,	0x79E2,	0x7B7D,	0x7D07,	0x7EA8,	0x8037,	0x81DD,
   0x8371,	0x851D,	0x86B6,	0x8868,	0x8A07,	0x8BBF,	0x8D65,	0x8F23,
   0x90CF,	0x927E,	0x9447,	0x95FE,	0x97CE,	0x998B,	0x9B63,	0x9D29,
   0x9F09,	0xA0D7,	0xA2C0,	0xA496,	0xA688,	0xA867,	0xAA63,	0xAC4C,
   0xAE52,	0xB045,	0xB256,	0xB453,	0xB66F,	0xB877,	0xBAA0,	0xBCB3,
   0xBEE8,	0xC109,	0xC32F,	0xC578,	0xC7AC,	0xCA04,	0xCC46,	0xCEAD,
   0xD0FE,	0xD375,	0xD5D7,	0xD85F,	0xDAD1,	0xDD6C,	0xDFF0,	0xE29E,
   0xE535,	0xE7F7,	0xEAA3,	0xED7B,	0xF03C,	0xF32C,	0xF604,	0xF90E,
  
};


#define PT_OFFSET   30             // Offset, Start bei bei -30 °C
#define PT_ADC_OFFSET   553         // Startwert der ADC-Messung
#define PT_ADC_FAKTOR   32             // 0x60, Multiplikator

// Syntax: xy = pgm_read_word(&PT[xy])
const uint16_t PT[] PROGMEM =
{
   0x0,	0xF,	0x1F,	0x2F,	0x3F,	0x4F,	0x5F,	0x6F,
   0x7F,	0x92,	0xA4,	0xB7,	0xC9,	0xDC,	0xEE,	0x101,
   0x113,	0x126,	0x139,	0x14C,	0x15E,	0x171,	0x184,	0x196,
   0x1A9,	0x1BC,	0x1CF,	0x1E2,	0x1F5,	0x208,	0x21B,	0x22E,
   0x241,	0x254,	0x267,	0x27B,	0x28E,	0x2A1,	0x2B4,	0x2C7,
   0x2DA,	0x2EE,	0x301,	0x315,	0x328,	0x33C,	0x34F,	0x363,
   0x376,	0x389,	0x39D,	0x3B1,	0x3C5,	0x3D8,	0x3EC,	0x400,
   0x413,	0x427,	0x43B,	0x44F,	0x463,	0x477,	0x48B,	0x49F,
   0x4B2,	0x4C6,	0x4DA,	0x4EF,	0x503,	0x517,	0x52B,	0x540,
   0x553,	0x567,	0x57C,	0x590,	0x5A5,	0x5B9,	0x5CE,	0x5E3,
   0x5F6,	0x60A,	0x61F,	0x634,	0x649,	0x65E,	0x673,	0x688,
   0x69B,	0x6B0,	0x6C5,	0x6DA,	0x6EF,	0x704,	0x719,	0x72F,
   0x742,	0x757,	0x76C,	0x782,	0x797,	0x7AD,	0x7C2,	0x7D8,
   0x7EA,	0x800,	0x816,	0x82C,	0x841,	0x857,	0x86D,	0x883,
   0x896,	0x8AC,	0x8C2,	0x8D8,	0x8EE,	0x904,	0x91A,	0x930,
   0x943,	0x959,	0x970,	0x986,	0x99C,	0x9B3,	0x9C9,	0x9E0,
   0x9F3,	0xA09,	0xA20,	0xA37,	0xA4D,	0xA64,	0xA7B,	0xA92,
   0xAA4,	0xABB,	0xAD2,	0xAE9,	0xB00,	0xB17,	0xB2E,	0xB46,
   0xB58,	0xB70,	0xB87,	0xB9E,	0xBB6,	0xBCD,	0xBE4,	0xBFC,
   0xC0E,	0xC26,	0xC3E,	0xC56,	0xC6D,	0xC85,	0xC9D,	0xCB5,
   0xCC8,	0xCE0,	0xCF8,	0xD10,	0xD28,	0xD40,	0xD58,	0xD70,
   0xD83,	0xD9B,	0xDB4,	0xDCC,	0xDE5,	0xDFD,	0xE16,	0xE2E,
   0xE40,	0xE59,	0xE72,	0xE8A,	0xEA3,	0xEBC,	0xED5,	0xEEE,
   0xF00,	0xF19,	0xF33,	0xF4C,	0xF65,	0xF7E,	0xF97,	0xFB1,
   0xFC3,	0xFDD,	0xFF6,	0x1010,	0x1029,	0x1043,	0x105D,	0x1076,
   0x1089,	0x10A3,	0x10BD,	0x10D7,	0x10F1,	0x110B,	0x1125,	0x113F,
   0x1150,	0x116B,	0x1185,	0x11A0,	0x11BA,	0x11D4,	0x11EF,	0x1209,
   0x121B,	0x1236,	0x1250,	0x126B,	0x1286,	0x12A1,	0x12BC,	0x12D7,
   0x12E9,	0x1304,	0x131F,	0x133B,	0x1356,	0x1371,	0x138C,	0x13A8,
   0x13B9,	0x13D5,	0x13F0,	0x140C,	0x1428,	0x1443,	0x145F,	0x147B,
   0x148C,	0x14A8,	0x14C4,	0x14E1,	0x14FD,	0x1519,	0x1535,	0x1551,
   0x1562,	0x157F,	0x159C,	0x15B8,	0x15D5,	0x15F1,	0x160E,	0x162B,
   0x163C,	0x1659,	0x1676,	0x1693,	0x16B0,	0x16CD,	0x16EA,	0x1707,
   0x1718,	0x1736,	0x1753,	0x1771,	0x178F,	0x17AC,	0x17CA,	0x17E7,
   0x17F7,	0x1815,	0x1833,	0x1851,	0x186F,	0x188D,	0x18AC,	0x18CA,
   0x18DA,	0x18F9,	0x1917,	0x1936,	0x1955,	0x1973,	0x1992,	0x19B0,
   0x19C0,	0x19DF,	0x19FE,	0x1A1D,	0x1A3C,	0x1A5B,	0x1A7B,	0x1A9A,
   0x1AA9,	0x1AC9,	0x1AE8,	0x1B08,	0x1B28,	0x1B47,	0x1B67,	0x1B86,
   0x1B96,	0x1BB6,	0x1BD6,	0x1BF6,	0x1C16,	0x1C37,	0x1C57,	0x1C77,};


uint16_t loopCount0=0;
uint16_t loopCount1=0;
uint16_t loopCount2=0;

uint16_t pwmpos=0;

#define PROGRAMM_DS	0
#define GRUPPE_DS		0xC0
//#define GRUPPE_DS	0xB0

#define TWI_PORT		PORTC
#define TWI_PIN		PINC
#define TWI_DDR		DDRC

#define SDAPIN		4
#define SCLPIN		5

#define SPI_PORT     PORTB
#define SPI_PIN      PINB
#define SPI_DDR      DDRB



#define TASTE1		19
#define TASTE2		29
#define TASTE3		44
#define TASTE4		67
#define TASTE5		94
#define TASTE6		122
#define TASTE7		155
#define TASTE8		186
#define TASTE9		205
#define TASTEL		223
#define TASTE0		236
#define TASTER		248
#define TASTATURPORT PORTC
#define TASTATURPIN		3

#define MANUELL_PORT		PORTD
#define MANUELL_DDR		DDRD
#define MANUELL_PIN		PIND

#define MANUELL			7	// Bit 7 von Status 
#define MANUELLPIN		6	// Pin 6 von PORT D fuer Anzeige Manuell
#define MANUELLNEU		7	// Pin 7 von Status. Gesetzt wenn neue Schalterposition eingestellt
#define MANUELLTIMEOUT	100 // Loopled-counts bis Manuell zurueckgesetzt wird. 02FF: ca. 100 s


#define FOSC 1000000    /* oscillator-frequency in Hz */
#define BAUD 57600  //valid values:9600, 19200, 57600 kbits


volatile uint8_t					Programmstatus=0x00;
	uint8_t Tastenwert=0;
	uint8_t TastaturCount=0;
volatile uint16_t					Manuellcounter=0; // Countr fuer Timeout	
	uint16_t TastenStatus=0;
	uint16_t Tastencount=0;
	uint16_t Tastenprellen=0x01F;

volatile uint8_t data;

volatile uint16_t	spiwaitcounter=0;


volatile uint8_t spi_status=0;

//Variablen WL
// MARK: WL Defs
volatile uint8_t wl_status=0;
volatile uint8_t PTX=0;
volatile uint8_t int0counter=0;
volatile uint8_t sendcounter=0;
volatile uint8_t wl_spi_status;
char itoabuffer[20];
volatile uint8_t wl_data[wl_module_PAYLOAD] = {};


