ruediheimlicher/Atmega8_WL/Atmega8_WL.c
#if defined(__AVR_ATmega88A__)
   EICRA = ((1<<ISC11)|(0<<ISC10)|(1<<ISC01)|(0<<ISC00));	// Set external interupt on falling edge for INT0 and INT1
   EIMSK  = ((0<<INT1)|(1<<INT0));							// Activate INT0
#endif // __AVR_ATmega88A__
   
#if defined(__AVR_ATmega168__)
   // Initialize external interrupt on port PD6 (PCINT22)
   DDRB &= ~(1<<PD6);
   PCMSK2 = (1<<PCINT22);
   PCICR  = (1<<PCIE2);
#endif // __AVR_ATmega168__
   
#if defined(__AVR_ATmega32U4__)
   // Initialize external interrupt on port PD0
   INTERRUPT_DDR &= ~(1<<INT0_PIN);
   INTERRUPT_PORT |= (1<<INT0_PIN);

   EICRA = ((1<<ISC11)|(0<<ISC10)|(1<<ISC01)|(0<<ISC00));
   
   // Set external interupt on falling edge for INT0 and INT1
   EIMSK  = ((1<<INT0));
   
#endif // __AVR_ATmega32U4__
   
}

char SPI_get_put_char(int cData)
{
   
   //Putchar -- Master
   /* Start transmission */
   SPDR = cData;
   /* Wait for transmission complete */
   while(!(SPSR & (1<<SPIF)))
      ;
   /* Return data register */
   return SPDR;
}

void SPI_Init(void)
{
   //http://www.atmel.com/dyn/resources/prod_documents/doc2467.pdf  page:165
   /*
   SPI_DDR |= (1<<2)|(1<<3)|(1<<5);
   SPI_DDR &= ~(1<<4);
   SPCR |= (1<<MSTR);
   SPCR |= (1<<SPR0)|(1<<SPR1);
   SPCR |= (1<<SPE);
   */
   
   
  
   //Master init
   // Set MOSI and SCK output, all others input
   SPI_DDR &= ~(1<<SPI_MISO);
   SPI_DDR |= (1<<SPI_MOSI)|(1<<SPI_CLK)|(1<<SPI_SS);
   
   
   // Enable SPI, Master, set clock rate fck/16 
   SPCR =   (1<<SPE)|
            (1<<MSTR)|
   (1<<SPR0);//|
            //(1<<SPR1);
   
   /*
    Slave init
    // Set MISO output, all others input
    DDR_SPI = (1<<DD_MISO);
    // Enable SPI 
    SPCR = (1<<SPE);
    */
   
}

void timer1_comp(void)
{
   // Set pin for driving resistor low.
   COMP_DDR |= (1<<COMP_DRIVE_PIN_A);
   COMP_PORT &= ~(1<<COMP_DRIVE_PIN_A);
   COMP_DDR |= (1<<COMP_DRIVE_PIN_B);
   COMP_PORT &= ~(1<<COMP_DRIVE_PIN_B);
   
   // Disable the digital input buffers.
   //   DIDR = (1<<AIN1D) | (1<<AIN0D);
   if (MULTIPLEX)
   {
      // ADC-Eingaenge fuer Capt
      COMP_ADC_DDR &= ~(1<<COMP_ADC_PIN_A);
      COMP_ADC_PORT &= ~(1<<COMP_ADC_PIN_A);
      
      COMP_ADC_DDR &= ~(1<<COMP_ADC_PIN_B);
      COMP_ADC_PORT &= ~(1<<COMP_ADC_PIN_B);
      
      // AIN0, AIN1 Eingang
      COMP_AIN_DDR &= ~(1<<COMP_AIN0);
      COMP_AIN_DDR &= ~(1<<COMP_AIN1);
      
      
      SFIOR |= (1<<ACME);
      //ADMUX = 3;
   }
   
   
   //ADCSRA =0;//| = (1<<ADEN);                    // disable ADC if necessary
   ACSR =   (1<<ACIC) | (1<<ACIS1) | (1<<ACIS0);   // Comparator enabled, no bandgap, input capture.
   // Timer...
   TCCR1A = 0;
   TCCR1B =   (1<<CS10);                        // F_CPU / 1
   //TCCR1B =  (1<<ICES1);                      // Input capture on rising edge
   TCNT1 = 0;
   TIMSK |= (1<<TOIE1) | (1<<TICIE1);           // Timer interrupts on capture and overflow.
   sei();
}


#pragma mark timer1
// Timer1 Servo
/*
void timer1(void)
{
   
   // https://www.mikrocontroller.net/topic/83609
   
   
   OCR1A = 0x3E8;           // Pulsdauer 1ms
   OCR1A = 0x200;
 
   ICR1 = 0x6400;          // 0x6400: Pulsabstand 50 ms
   // http://www.ledstyles.de/index.php/Thread/18214-ATmega32U4-Schaltungen-PWM/
   DDRB |= (1<<PB1);
   
   TCCR1A |= (1<<COM1A1)|(1<<COM1B1)|(1<<WGM10);
   
   TCCR1B |= (1<<WGM12)|(1<<CS11);
   
   //  TIMSK |= (1<<OCIE1A) | (1<<TICIE1); // OC1A Int enablad
}

*/

ISR(TIMER1_CAPT_vect)
{
   // Save the captured value and drop the drive line.
   if (captured == 0)
   {
      // captured_value = ICR1;
      captcounter++;
      
      if (adckanal == COMP_ADC_PIN_A)
      {
         mittelwertA[mposA++] = ICR1;           // Ringbuffer fuer gleitenden Mittelwert
         mposA &= 0x03;                         // position incrementieren
         COMP_PORT &= ~(1<<COMP_DRIVE_PIN_A);   // auf 4 beschraenken
      }
      
      if (adckanal == COMP_ADC_PIN_B)
      {
         mittelwertB[mposB++] = ICR1;
         mposB &= 0x03;
         COMP_PORT &= ~(1<<COMP_DRIVE_PIN_B);
      }
      TCNT1 = 0;
      captured = 1;
   }
   //TCNT1 = 0;
}

/*
#pragma mark INT0 WL
ISR(INT0_vect)
{
   wl_spi_status |= (1<<7);
   
}
*/
#pragma mark INT1 WL
ISR(INT1_vect)
{
   wl_spi_status |= (1<<7);
   
}

ISR (SPI_STC_vect)
{
  // SPDR = data;
}



int main (void)
{
	/* INITIALIZE */
//	LCD_DDR |=(1<<LCD_RSDS_PIN);
//	LCD_DDR |=(1<<LCD_ENABLE_PIN);
//	LCD_DDR |=(1<<LCD_CLOCK_PIN);
	
	deviceinit();
	
   SPI_Init();
   SPI_Master_init();
	lcd_initialize(LCD_FUNCTION_8x2, LCD_CMD_ENTRY_INC, LCD_CMD_ON);
	lcd_puts("Guten Tag\0");
	delay_ms(1000);
   
	lcd_cls();
   lcd_gotoxy(0,0);
	lcd_puts("READY\0");
	
	// DS1820 init-stuff begin
	// DS1820 init-stuff end
   
   volatile char incoming=0;
   size_t poscounter=0;
   
   // MARK: WL main
   uint8_t payload[wl_module_PAYLOAD];
   uint8_t maincounter =0;
   //Array for Payload
   
   wl_module_init();
   _delay_ms(50);
  
   sei();
   
   wl_module_rx_config();
  
   delay_ms(50);
   wl_module_CE_hi;
   //
   lcd_clr_line(0);
   
   //lcd_puts(" und");
   /*
   DDRC |= (1<<0);
   DDRC |= (1<<1);
   PORTC |= (1<<0);
   PORTC &= ~(1<<1);
   */
  // timer1_comp();
   initADC(2);
   
   uint8_t delaycount=10;
  #pragma mark while
   uint8_t readstatus = wl_module_get_data((void*)&wl_data);
   //lcd_puts(" los");
   sei();
   while (1)
	{
    //  PORTC |= (1<<0);
		loopCount0 ++;
		//_delay_ms(2);
		//LOOPLED_PORT ^= (1<<LOOPLED_PIN);
      //incoming = SPDR;
      
      if (wl_spi_status & (1<<7)) // in ISR gesetzt
      {
         
         if (int0counter < 0x2F)
         {
            int0counter++;
         }
         else
         {
            int0counter=0;
         }
         
         wl_spi_status &= ~(1<<7);
         
         //lcd_gotoxy(14,1);
         //lcd_puthex(int0counter);
         lcd_gotoxy(18,1);
         lcd_puthex(wl_status);
// MARK: WL Loop
         /*
         lcd_gotoxy(0,1);
         lcd_puthex(wl_status & (1<<RX_DR));
         lcd_puthex(wl_status & (1<<TX_DS));
         lcd_puthex(wl_status & (1<<MAX_RT));
         lcd_puthex(wl_status & (1<<TX_FULL));
         */
         wl_status = wl_module_get_status();
         
         lcd_gotoxy(0,0);
         //lcd_puts("          ");
         if (wl_status & (1<<RX_DR)) // IRQ: Package has been sent
         {
            //OSZIA_LO;
            lcd_gotoxy(0,0);
            lcd_puts("RX");
            uint8_t rec = wl_module_get_rx_pw(0);
            //lcd_gotoxy(0,3);
            //lcd_puthex(rec);
            //lcd_putc(' ');
            uint8_t readstatus = wl_module_get_data((void*)&wl_data);
            uint8_t i;
            lcd_gotoxy(4,0);
            lcd_puts("rs:");
            lcd_puthex(readstatus);
            lcd_putc(' ');
            lcd_putint1(wl_data[0]);
            lcd_putc('.');
            for (i=2; i<4; i++)
            {
               lcd_putint1(wl_data[i]);
            }
            //lcd_putc(' ');
            uint16_t temperatur = (wl_data[11]<<8);
            temperatur |= wl_data[10];
            //lcd_putint12(temperatur);
            
            temperatur /=4; // *256/1024, unkalibriert
        //    lcd_putint2(temperatur/10);
        //    lcd_putc('.');
        //   lcd_putint1(temperatur%10);

            //lcd_put_tempbis99(temperatur);

//            lcd_gotoxy(18,3);
//            lcd_puthex(wl_data[9]);
            pwmpos = temperatur;
            OCR1A = temperatur;
            OSZIA_HI;
            
