ruediheimlicher/Atmega8_WL/Atmega8_WL.c
            wl_spi_status |= (1<<6);
            
          }
         
         if (wl_status & (1<<TX_DS)) // IRQ: Package has been sent
         {
            //OSZIA_LO; // 50 ms mit Anzeige, 140us ohne Anzeige
            sendcounter++;
       //     lcd_gotoxy(3,0);
       //     lcd_puts("TX");
            wl_module_config_register(STATUS, (1<<TX_DS)); //Clear Interrupt Bit
            PTX=0;
            //OSZIA_HI;
         }
         
         if (wl_status & (1<<MAX_RT)) // IRQ: Package has not been sent, send again
         {
            lcd_gotoxy(6,0);
            lcd_puts("RT");
            
            wl_module_config_register(STATUS, (1<<MAX_RT)); // Clear Interrupt Bit
            wl_module_CE_hi;
            _delay_us(10);
            wl_module_CE_lo;
         }
       
         
         
      } // end ISR abarbeiten


		if (loopCount0 >=0xFE)
		{
			
			loopCount1++;

			if ((loopCount1 >0x02AF) )//&& (!(Programmstatus & (1<<MANUELL))))
			{
            LOOPLED_PORT ^= (1<<LOOPLED_PIN);
            // WL-Routinen
            
            // WL
            //OSZIA_LO;
            /*
            wl_module_CE_lo;
            _delay_ms(5);
            wl_module_CSN_lo;
            _delay_ms(5);
            wl_module_CSN_hi;
            _delay_ms(5);
            wl_module_CE_hi;
             */
            
// MARK: ADC Loop
            
 // MARK:  LM335
            uint16_t adc2wert = readKanal(2);
           
            //lcd_puthex(adc2wert&0x00FF);
            //lcd_puthex((adc2wert&0xFF00)>>8);
            lcd_gotoxy(0,3);
            lcd_puts("k2 ");
            lcd_putint12(adc2wert);
            
           
            //lcd_putint12(adcwert);
            //uint16_t temperatur2 =  adc2wert*10/4; // *256/1024, unkalibriert
            //lcd_gotoxy(12,1);
            //lcd_putint12(temperatur2);

            //uint32_t temperatur2 =  adc2wert*265; // *265/1024, unkalibriert
            // uint16_t t1 = adc2wert*VREF;
            
            uint32_t temperatur2 = adc2wert;
            temperatur2 *=VREF;
            //t1 = t1/0x20;
            //lcd_gotoxy(0,3);
            //lcd_putint16(temperatur2);
            temperatur2 = temperatur2/0x20;
            lcd_gotoxy(8,1);
            lcd_putint12(temperatur2);
            temperatur2 = 10*temperatur2/0x20;
            lcd_gotoxy(8,3);
            lcd_putint12(temperatur2&0xFFFF);
            
            lcd_gotoxy(13,3);
            lcd_putint12(temperatur2/10);
            lcd_putc('.');
            lcd_putint1(temperatur2%10);
           
            
            PT_HI;
            
            //lcd_gotoxy(0,1);
            //_delay_us(300);
            OSZIA_LO;
            
// MARK: KTY
            // KTY
            uint16_t adc3wert = readKanal(3);
             PT_LO;
            OSZIA_HI;
//            lcd_gotoxy(0,0);
            //lcd_puthex(adc3wert&0x00FF);
            //lcd_puthex((adc3wert&0xFF00)>>8);
            //lcd_gotoxy(6,2);
//            lcd_putc('k');
//            lcd_putint12(adc3wert);
         //   adc3wert-=6;
            /*
             #define KTY_OFFSET   30             // Offset, Start bei bei -30 °C
             #define ADC_OFFSET   204            // Startwert der ADC-Messung
             #define KTY_FAKTOR   96             // 0x60, Multiplikator
             // pgm_read_word(&KTY[xy])
             */
            uint16_t tableindex = ((adc3wert - ADC_OFFSET)>>3); // abrunden auf Intervalltakt
//            lcd_putc(' ');
           // lcd_putint(tableindex);
            uint8_t col = (adc3wert - ADC_OFFSET) & 0x07;
           // lcd_putc(' ');
           //lcd_putint2(col);
            uint16_t ktywert = pgm_read_word(&KTY[tableindex]); // Wert in Tabelle, unterer Wert
//            lcd_putint12(ktywert);

            if (col) // nicht exakter wert, interpolieren
           {
              uint16_t diff = pgm_read_word(&KTY[tableindex+1])-ktywert;
              //diff = (diff * col)<<3;
              ktywert += (diff * col)>>3;
           }
            
//            lcd_putc(' ');
//            lcd_putint12((ktywert));

       //     lcd_putc(' ');
       //     lcd_putint12((ktywert/KTY_FAKTOR)-KTY_OFFSET);
// MARK: PT1000
            // PT1000
            uint16_t adc4wert = readKanal(4);
            lcd_gotoxy(0,2);
            lcd_puts("k4 ");
            lcd_putint12(adc4wert);
            //uint32_t temperatur4 =  adc4wert*VREF; // *256/1024, unkalibriert
            //temperatur4 /= 32;
            
            //lcd_putc(' ');
            //lcd_putint16(temperatur4 & 0xFFFF);
            //
            //lcd_putint(temperatur4/10);
            //lcd_putc('.');
            //lcd_putint1(temperatur4%10);

            // lookup
            //lcd_gotoxy(0,2);
            uint16_t pttableindex = ((adc4wert - PT_ADC_OFFSET)>>3); // abrunden auf Intervalltakt
            lcd_putc(' ');
            lcd_putint2(pttableindex);
            uint8_t ptcol = (adc4wert - PT_ADC_OFFSET) & 0x07;
            lcd_putc(' ');
            lcd_putint1(ptcol);
            lcd_putc('*');
            uint16_t ptwert = pgm_read_word(&PT[8*pttableindex+ptcol]); // Wert in Tabelle
            lcd_putint12(ptwert);

            //lcd_putc('*');
            //lcd_putint12((ptwert/PT_ADC_FAKTOR));
            ptwert /= PT_ADC_FAKTOR;
            ptwert -= PT_OFFSET;
            lcd_gotoxy(12,1);
            lcd_putc(' ');
            lcd_putc('t');
            //lcd_putc(' ');

            //lcd_putc('*');
            if (ptwert < 100)
            {
               lcd_putc(' ');
               lcd_putint2(ptwert);
            }
           else
           {
              lcd_putint(ptwert);
           }
            lcd_putc('*');
            
            // end lookup

//            lcd_putc(' ');
//            uint16_t diff = pgm_read_word(&KTY[tableindex+1])-ktywert;
//            diff = (diff * col)>>3;

//            lcd_putint12(diff);
           
           // lcd_gotoxy(6,2);
            //lcd_puthex((ktywert & 0xFF00)>>8);
           // lcd_puthex(ktywert & 0x00FF);
           // lcd_putc(' ');
           // lcd_putint12(adc3wert - ADC_OFFSET);
           // lcd_putint12(ktywert);
            /*
            lcd_gotoxy(12,2);
            //lcd_putint12(adcwert);
            uint16_t temperatur3 =  adc3wert*10/4; // *256/1024, unkalibriert
            lcd_putint(temperatur3/10);
            lcd_putc('.');
            lcd_putint1(temperatur3%10);
*/
            
            uint8_t k;
            for (k=0; k<wl_module_PAYLOAD; k++)
            {
               payload[k] = wl_module_PAYLOAD-k;
            }
            // Euler 2,71828182
            payload[0] = maincounter;
            payload[1] = 0;
            payload[2] = 2;
            payload[3] = 0;
            payload[4] = 7;
            payload[5] = 1;
            payload[6] = 8;
            payload[7] = 2;
            
            payload[10] = adc2wert & 0x00FF;
            payload[11] = (adc2wert & 0xFF00)>>8;
 
//            payload[12] = adc3wert & 0x00FF;
//            payload[13] = (adc3wert & 0xFF00)>>8;
            payload[12] = (ktywert/KTY_FAKTOR) & 0x00FF;
            payload[13] = ((ktywert/KTY_FAKTOR) & 0xFF00)>>8;
            
